back-end/Testes/Carga/cenarios/endurance_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Endurance Test - Resistência" enabled="true">
      <stringProp name="TestPlan.comments">Teste de Resistência - 30 usuários por 2 horas para detectar memory leaks</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">5001</stringProp>
          </elementProp>
          <elementProp name="ENDURANCE_USERS" elementType="Argument">
            <stringProp name="Argument.name">ENDURANCE_USERS</stringProp>
            <stringProp name="Argument.value">30</stringProp>
          </elementProp>
          <elementProp name="DURATION_HOURS" elementType="Argument">
            <stringProp name="Argument.name">DURATION_HOURS</stringProp>
            <stringProp name="Argument.value">7200</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      
      <!-- HTTP Request Defaults -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">/api</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
      </ConfigTestElement>
      <hashTree/>
      
      <!-- HTTP Header Manager -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      
      <!-- Endurance Test Thread Group -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Endurance Test Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${ENDURANCE_USERS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">180</stringProp>
        <stringProp name="ThreadGroup.duration">${DURATION_HOURS}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.comments">Carga constante por 2 horas para detectar vazamentos de memória</stringProp>
      </ThreadGroup>
      <hashTree>
        
        <!-- Cenário Realista: Workflow Médico -->
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Workflow Médico Completo" enabled="true"/>
        <hashTree>
          
          <!-- 1. Health Check Periódico -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 - Health Check" enabled="true">
            <stringProp name="HTTPSampler.path">/health</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <intProp name="Assertion.test_type">1</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          
          <!-- 2. Consultar Lista de Gestantes -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 - Listar Gestantes" enabled="true">
            <stringProp name="HTTPSampler.path">/gestantes</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <intProp name="Assertion.test_type">1</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          
          <!-- Think Time - Análise da Lista -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Análise da Lista" enabled="true">
            <stringProp name="ConstantTimer.delay">3000</stringProp>
            <stringProp name="RandomTimer.range">5000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
          
          <!-- 3. Predição ML - Caso Normal -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="03 - Predição ML Normal" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{
  "baseline_value": 142,
  "accelerations": 4,
  "fetal_movement": 3,
  "uterine_contractions": 1,
  "light_decelerations": 0,
  "severe_decelerations": 0,
  "prolonged_decelerations": 0,
  "abnormal_short_term_variability": 20,
  "mean_value_of_short_term_variability": 0.8,
  "percentage_of_time_with_abnormal_long_term_variability": 15,
  "mean_value_of_long_term_variability": 10.5,
  "histogram_width": 72,
  "histogram_min": 122,
  "histogram_max": 162,
  "histogram_number_of_peaks": 2,
  "histogram_number_of_zeroes": 0,
  "histogram_mode": 142,
  "histogram_mean": 144,
  "histogram_median": 143,
  "histogram_variance": 20,
  "histogram_tendency": 1
}</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/predict</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <intProp name="Assertion.test_type">1</intProp>
            </ResponseAssertion>
            <hashTree/>
            
            <!-- Validar Resposta ML -->
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Validar Resposta ML" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="1019893063">prediction</stringProp>
                <stringProp name="951530617">confidence</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          
          <!-- Think Time - Análise do Resultado -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Análise do Resultado" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">4000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
          
          <!-- 4. Predição ML - Caso Suspeito (30% das vezes) -->
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Se Caso Suspeito" enabled="true">
            <stringProp name="IfController.condition">${__Random(1,100)} &lt;= 30</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="04 - Predição ML Suspeita" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{
  "baseline_value": 120,
  "accelerations": 1,
  "fetal_movement": 1,
  "uterine_contractions": 3,
  "light_decelerations": 2,
  "severe_decelerations": 0,
  "prolonged_decelerations": 0,
  "abnormal_short_term_variability": 35,
  "mean_value_of_short_term_variability": 1.5,
  "percentage_of_time_with_abnormal_long_term_variability": 35,
  "mean_value_of_long_term_variability": 5.5,
  "histogram_width": 45,
  "histogram_min": 100,
  "histogram_max": 140,
  "histogram_number_of_peaks": 1,
  "histogram_number_of_zeroes": 5,
  "histogram_mode": 120,
  "histogram_mean": 118,
  "histogram_median": 119,
  "histogram_variance": 35,
  "histogram_tendency": 0
}</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.path">/predict</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
            </HTTPSamplerProxy>
            <hashTree>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200" enabled="true">
                <collectionProp name="Asserion.test_strings">
                  <stringProp name="49586">200</stringProp>
                </collectionProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <intProp name="Assertion.test_type">1</intProp>
              </ResponseAssertion>
              <hashTree/>
            </hashTree>
            
          </hashTree>
          
          <!-- 5. Consulta Específica de Gestante (20% das vezes) -->
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Se Consulta Específica" enabled="true">
            <stringProp name="IfController.condition">${__Random(1,100)} &lt;= 20</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="05 - Buscar Gestante Específica" enabled="true">
              <stringProp name="HTTPSampler.path">/gestantes/TEST${__Random(1000,9999)}</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
            </HTTPSamplerProxy>
            <hashTree>
              <!-- Aceitar tanto 200 quanto 404 -->
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200 ou 404" enabled="true">
                <collectionProp name="Asserion.test_strings">
                  <stringProp name="49586">200</stringProp>
                  <stringProp name="51512">404</stringProp>
                </collectionProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <intProp name="Assertion.test_type">1</intProp>
              </ResponseAssertion>
              <hashTree/>
            </hashTree>
            
          </hashTree>
          
          <!-- Think Time Final - Pausa entre Ciclos -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Pausa entre Ciclos" enabled="true">
            <stringProp name="ConstantTimer.delay">5000</stringProp>
            <stringProp name="RandomTimer.range">10000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
          
        </hashTree>
        
      </hashTree>
      
      <!-- Listeners para Monitoramento Contínuo -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      
      <!-- Monitor de Performance ao Longo do Tempo -->
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      
    </hashTree>
  </hashTree>
</jmeterTestPlan>